#+TITLE: Conformance Testing the Kubernetes API
#+SUBTITLE: Tooling that Makes the Difference
#+AUTHOR: Stephen Heywood & Caleb Woodbine, ii.nz

#+begin_notes
Welcome to TITLE

Introductions
#+end_notes

** Get Results
#+BEGIN_NOTES
- At the end of the run, you will end up with several files
- these show the complete results of your test run
- You will need to include these files in your PR to k8s-conformance
#+END_NOTES
    #+begin_src tmate :window results :var RUN="RESULTS"
      outfile=$(sonobuoy retrieve)
      mkdir ./results; tar xzf $outfile -C ./results
    #+end_src

    #+RESULTS:
    #+begin_example
    ./results/global
    ./results/global/junit_01.xml
    ./results/global/e2e.log
    #+end_example
** Launching
#+begin_src shell :async yes :dir /tmp :prologue "(\n" :epilogue "\n) 2>&1 ; :"
git clone https://github.com/cncf/apisnoop
cd apisnoop/kind
kind create cluster --image kindest/node:v1.22.1 --config kind+apisnoop.yaml
#+end_src

#+RESULTS:
#+begin_example
Creating cluster "kind" ...
 • Ensuring node image (kindest/node:v1.22.1) 🖼  ...
 ✓ Ensuring node image (kindest/node:v1.22.1) 🖼
 • Preparing nodes 📦 📦   ...
 ✓ Preparing nodes 📦 📦
 • Writing configuration 📜  ...
 ✓ Writing configuration 📜
 • Starting control-plane 🕹️  ...
 ✓ Starting control-plane 🕹️
 • Installing CNI 🔌  ...
 ✓ Installing CNI 🔌
 • Installing StorageClass 💾  ...
 ✓ Installing StorageClass 💾
 • Joining worker nodes 🚜  ...
 ✓ Joining worker nodes 🚜
Set kubectl context to "kind-kind"
You can now use your cluster with:

kubectl cluster-info --context kind-kind

Have a nice day! 👋
#+end_example

#+begin_notes
CALEB

Bringing up APISnoop on kind is easy.

Clone the APISnoop repo and create a kind cluster with it's configuration.
#+end_notes

** STOW In Cluster Interfacing

   #+begin_src bash :eval never
      export PGUSER=apisnoop PGHOST=localhost
   #+end_src

   #+begin_src bash :var PGHOST="localhost" :var PGUSER="apisnoop" :prologue "export PGHOST PGUSER" :wrap example
      psql -c "select distinct useragent \
                 from testing.audit_event \
                 where useragent not ilike 'kube-%';"
   #+end_src

   #+RESULTS:
   #+begin_example
                              useragent
   ----------------------------------------------------------------
    kubelet/v1.18.0 (linux/amd64) kubernetes/9e99141
    kindnetd/v0.0.0 (linux/amd64) kubernetes/$Format
    sonobuoy/v0.0.0 (darwin/amd64) kubernetes/$Format
    kubectl/v1.19.2 (darwin/amd64) kubernetes/f574309
    coredns/v0.0.0 (linux/amd64) kubernetes/$Format
    local-path-provisioner/v0.0.0 (linux/amd64) kubernetes/$Format
   (6 rows)

   #+end_example

* footer :noexport:
Link up this folder to the web
#+begin_src shell :results silent
rm ~/public_html
ln -s $PWD ~/public_html
#+end_src

Generate a token
#+begin_src shell
curl -s https://multiplex.kccncna2021.pair.sharing.io/token | jq .
#+end_src

#+RESULTS:
#+begin_example
{
  "secret": "16303595814587938032",
  "socketId": "1ea00b34ec29b2a6"
}
#+end_example

Delete the Namespace
#+begin_src shell
kubectl delete ns kubecon-na-2021
#+end_src

#+RESULTS:
#+begin_example
#+end_example

Clear SnoopDB
#+begin_src shell
psql -U apisnoop -d apisnoop -h snoopdb.apisnoop -c "DELETE FROM testing.audit_event WHERE release='live';"
#+end_src

#+RESULTS:
#+begin_example
DELETE 7162
#+end_example
